# -*- coding: utf-8 -*-
"""
Created on Wed Jul 29 04:15:30 2026

@author: Yegane
"""

list1 = ["Python","Java","C++"]
list2 = list1
print("آدرس  list1: ",id(list1))
print("آدرس  list2: ",id(list2))
list2.append("C#")
print(list1)
print(list2)

print("""
1. آیا list1 تغییر کرده است؟ بله
2. چرا هردو لیست تغییر کرده‌اند؟ چون هردو به یک خانه از حافظه اشاره میکنند
3. آیا list1 و list2 دو شیء متفاوت هستند؟ خیر
      """)

list1 = ["Python","Java","C++"]
list2 = list1.copy()
list2.append("C#")
print(list1)
print(list2)
print("آدرس  list1: ",id(list1))
print("آدرس  list2: ",id(list2))

print("""
چون در اینجا یک کپی از list1 در خانه دیگری از حافظه ذخیره شده
که متغیری با نام list2 به آن اشاره میکند id آنها برابر نیست.
      """)
      
print("----------------------------------- چالش -----------------------------------")
x = 100
y = x
print((id(x)))
print(id(y))
y = 200
print(x)
print(y)
print(id(x))
print(id(y))

print("""
 چرا این بار با تغییر y مقدار x تغییر نکرد؟ چون در اینجا عدد داریم
و وقتی مقدار y تغییر کرد درواقع y به خانه دیگری از حافظه اشاره میکنه که مقدار آن 200 است
      """)
      
print("""
متغیر در پایتون چیست؟ یک نام قابل تغییر است که به یک خانه از حافظه اشاره میکند
و مقدار را درخودش نگه نمیدارد بلکه به خانه ای از حافظه که حاوی آن مقدار است اشاره میکند.
شیء چیست؟ هرچیزی در پایتون یک شی است
تفاوت کپی کردن یک مرجع با کپی کردن یک شی چیست؟ با کپی کردن یک مرجع هردو به یک خانه در حافظه اشاره میکنند
ولی با کپی کردن شی هرمتغیر به خانه‌های مختلفی در حافظه اشاره میکنند.
چرا لیست‌ها رفتار متفاوتی با اعداد دارند؟ چون لیست‌ها قابل تغییرند ولی اعداد غیرقابل تغییرند.
      """)